results/out/httpkit.ring-middleware.async.java15.G1GC.r10k.t16.c400.d600s.out
Running 10m test @ http://localhost:9999/math/plus?x=1&y=2
  16 threads and 400 connections
  Thread calibration: mean lat.: 1.309ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.396ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.502ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.438ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.531ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.400ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.407ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.390ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.307ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.672ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.379ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.439ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.524ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.850ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.468ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.406ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.52ms    8.38ms   1.00s    99.95%
    Req/Sec   658.35    617.62     2.78k    70.72%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.31ms
 75.000%    1.77ms
 90.000%    2.29ms
 99.000%    3.94ms
 99.900%    7.76ms
 99.990%  523.01ms
 99.999%  950.27ms
100.000%    1.00s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.077     0.000000            1         1.00
       0.618     0.100000       592441         1.11
       0.812     0.200000      1180733         1.25
       0.985     0.300000      1772283         1.43
       1.148     0.400000      2360243         1.67
       1.307     0.500000      2952555         2.00
       1.386     0.550000      3247849         2.22
       1.467     0.600000      3539287         2.50
       1.556     0.650000      3834479         2.86
       1.657     0.700000      4131632         3.33
       1.771     0.750000      4425741         4.00
       1.834     0.775000      4571443         4.44
       1.904     0.800000      4719940         5.00
       1.982     0.825000      4868041         5.71
       2.069     0.850000      5016307         6.67
       2.167     0.875000      5162148         8.00
       2.223     0.887500      5236226         8.89
       2.285     0.900000      5310413        10.00
       2.353     0.912500      5382596        11.43
       2.435     0.925000      5457428        13.33
       2.529     0.937500      5530787        16.00
       2.583     0.943750      5567676        17.78
       2.645     0.950000      5604681        20.00
       2.715     0.956250      5640973        22.86
       2.801     0.962500      5678104        26.67
       2.907     0.968750      5714500        32.00
       2.975     0.971875      5733151        35.56
       3.053     0.975000      5751305        40.00
       3.151     0.978125      5769747        45.71
       3.275     0.981250      5788103        53.33
       3.441     0.984375      5806464        64.00
       3.551     0.985938      5815759        71.11
       3.681     0.987500      5824931        80.00
       3.837     0.989062      5834159        91.43
       4.019     0.990625      5843335       106.67
       4.239     0.992188      5852617       128.00
       4.367     0.992969      5857208       142.22
       4.507     0.993750      5861790       160.00
       4.667     0.994531      5866460       182.86
       4.847     0.995313      5871004       213.33
       5.059     0.996094      5875581       256.00
       5.183     0.996484      5877905       284.44
       5.327     0.996875      5880228       320.00
       5.491     0.997266      5882510       365.71
       5.715     0.997656      5884797       426.67
       6.015     0.998047      5887108       512.00
       6.215     0.998242      5888270       568.89
       6.475     0.998437      5889410       640.00
       6.827     0.998633      5890569       731.43
       7.267     0.998828      5891712       853.33
       7.827     0.999023      5892866      1024.00
       8.127     0.999121      5893438      1137.78
       8.439     0.999219      5894015      1280.00
       8.791     0.999316      5894595      1462.86
       9.247     0.999414      5895170      1706.67
       9.831     0.999512      5895740      2048.00
      10.391     0.999561      5896027      2275.56
      11.271     0.999609      5896314      2560.00
      12.039     0.999658      5896605      2925.71
      12.727     0.999707      5896893      3413.33
      13.935     0.999756      5897179      4096.00
      16.335     0.999780      5897322      4551.11
      75.775     0.999805      5897466      5120.00
     190.591     0.999829      5897610      5851.43
     305.919     0.999854      5897754      6826.67
     421.631     0.999878      5897899      8192.00
     481.279     0.999890      5897971      9102.22
     535.551     0.999902      5898043     10240.00
     591.359     0.999915      5898114     11702.86
     651.775     0.999927      5898189     13653.33
     706.559     0.999939      5898258     16384.00
     736.767     0.999945      5898294     18204.44
     765.439     0.999951      5898330     20480.00
     795.647     0.999957      5898368     23405.71
     823.295     0.999963      5898403     27306.67
     851.455     0.999969      5898439     32768.00
     866.303     0.999973      5898458     36408.89
     881.151     0.999976      5898474     40960.00
     895.487     0.999979      5898492     46811.43
     910.335     0.999982      5898512     54613.33
     922.623     0.999985      5898528     65536.00
     930.815     0.999986      5898539     72817.78
     940.031     0.999988      5898549     81920.00
     945.151     0.999989      5898555     93622.86
     950.783     0.999991      5898564    109226.67
     960.511     0.999992      5898574    131072.00
     962.559     0.999993      5898578    145635.56
     965.631     0.999994      5898582    163840.00
     970.751     0.999995      5898587    187245.71
     975.359     0.999995      5898592    218453.33
     979.967     0.999996      5898598    262144.00
     979.967     0.999997      5898598    291271.11
     982.527     0.999997      5898601    327680.00
     983.039     0.999997      5898603    374491.43
     985.599     0.999998      5898605    436906.67
     990.207     0.999998      5898607    524288.00
     990.719     0.999998      5898610    582542.22
     990.719     0.999998      5898610    655360.00
     995.839     0.999999      5898612    748982.86
     995.839     0.999999      5898612    873813.33
     999.935     0.999999      5898613   1048576.00
     999.935     0.999999      5898613   1165084.44
    1000.447     0.999999      5898614   1310720.00
    1002.495     0.999999      5898618   1497965.71
    1002.495     1.000000      5898618          inf
#[Mean    =        1.519, StdDeviation   =        8.380]
#[Max     =     1001.984, Total count    =      5898618]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5996549 requests in 10.00m, 869.25MB read
Requests/sec:   9994.23
Transfer/sec:      1.45MB